### Python for Data Science:
- Pandas
- Numpy
- Matplotlib
- Seaborn

In [1]:
import pandas as pd

df = pd.DataFrame({
    'id': [100,101,103,104],
    'Name': ['Avinash', 'Raghu', 'Aditya', 'Ashish'],
    'Age': [22,21,20,21],
    'Gender': ['M', 'M','M','M'],
    'Marks': [99, 56, 45, 86],
    'Grade': ['A', 'B', 'C', 'B']
})

In [2]:
df

    id     Name  Age Gender  Marks Grade
0  100  Avinash   22      M     99     A
1  101    Raghu   21      M     56     B
2  103   Aditya   20      M     45     C
3  104   Ashish   21      M     86     B

In [3]:
df.Name

0    Avinash
1      Raghu
2     Aditya
3     Ashish
Name: Name, dtype: object

In [6]:
df.columns

Index(['id', 'Name', 'Age', 'Gender', 'Marks', 'Grade'], dtype='object')

In [7]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [11]:
df2 = pd.DataFrame([[1,2,3,4,5],[10,20,30,40,50]], index=['a', 'b'], columns=[f'col{i}' for i in range(1,6)])
df2

   col1  col2  col3  col4  col5
a     1     2     3     4     5
b    10    20    30    40    50

In [15]:
df3 = pd.read_csv('Titanic-Dataset.csv')

In [17]:
df3.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [19]:
df3.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [21]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [22]:
df3.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200